{
  "title": "Kintsugi",
  "briefDescription": "An intuitive writing and self-improvement app designed to accelerate knowledge acquisition in an adaptive, non-linear way.",
  "longDescription": "An intuitive writing and self-improvement app designed to accelerate knowledge acquisition in an adaptive, non-linear way.",
  "type": "Live Demo",
  "ref": "https://www.figma.com/proto/4t0FGBwSUNvWVXd8pkba7n/Kintsugi--Rice-Design-A-Thon-2025?node-id=14-3214&p=f&t=Usfa8zafDVcz42Tk-1&scaling=scale-down&content-scaling=fixed&page-id=9%3A737&starting-point-node-id=9%3A738&show-proto-sidebar=1",
  "creationDate": "January 2025",
  "tags": ["Figma", "Hackathon"],  "mainImage": "/kintsugi.jpg",
  "galleryImages": [
    "/Daily Prompt.png",
    "/Knowledge Tree.png",
    "/Explore.png",
    "/Profile.png"
  ],
  "bodyText": "Building a knowledge database should be like building a second brain. With so many ideas floating around, it’s hard to pin them down and transform them into actual knowledge. Introducing Kintsugi—an intuitive writing and self-improvement app designed to accelerate knowledge acquisition in an adaptive, non-linear way.\n\nKintsugi is the Japanese art of repairing broken pottery with precious metal to highlight imperfections and the importance of time in creating art. Our ”Kintsugi” is a database that helps users turn fragmented thoughts into comprehensive integrated knowledge. Over time, Kintsugi builds a personalized learning algorithm for you, incorporating daily critical thinking prompts, writing exercise, media recommendations, study practice questions, and public forum to reinforce the information media we consume. Our app utilizes artificial intelligence to assign topic tags to notes and organize your Kintsugi based on subject similarity.\n\nTry Kintsugi and let us help you build a relationship with your knowledge.\n\nOur team conducted primary and secondary research, through ideation sessions based on personal experience, a Google Forms survey, and mainstream online opinion.\n\nWe began by ideating in FigJam to identify the challenges of staying human in the age of AI. We considered the current and potential future state of AI and how it benefits or corrupts society. Most significantly, we determined that over-reliance on AI tools have caused younger generations to lose critical thinking skills. Additionally, AI replaces many tedious jobs but has yet to replace art and creativity. Thus, we pondered what aspects of humanity are invaluable, and we determined that AI cannot mimic the uniqueness of humans, like our identity, self-expression, relationships, and privacy. These are the things that keep us humans. Moving forward, we wanted to consider how AI can be used to foster the aspects that make us human.\n\nDuring our app ideation process, we strongly focused on exploring how AI could be used to assist users with a desire to gain knowledge, shifting the focus from using AI as a second brain to regaining and training critical thinking skills. We landed on Kintsugi, our application to eliminate the tedious tasks that stand in the way of knowledge acquisition, such as cataloging information, and directly provide users with a platform for critical thinking.\n\nTo kick off our user research survey, we collected demographic/interest information that may relate to learning, such as education level, area of study, and types of media consumption. This would help us understand the kind of users and use cases for our idea. Although the data was mainly limited to personal contacts, many of whom are college students, 38.9% (7 out of 18) of our respondents were either high school students or graduated adults. We surveyed people across many areas of study. We gathered that most respondents consumed educational media from Tiktok, online forums like Twitter or Reddit, YouTube videos, and TV news/newspapers, but that few people take notes and that most of the notetakers only take notes on research papers, articles, and video media.\n\nWe found that most people jot down short-form thoughts and take notes on media, but less write out longer thinkpieces. The most popular learning methods were hands-on, experiential, visual, social, and logical.\n\nLastly, we determined that most people use AI tools for idea generation, researching topics, and directly answering questions. People conveyed that they think AI could improve their learning experience by breaking down complex concepts, helping with organization, and creating practice questions.\n\nUsing the collected data, we created user personas to analyze use cases for our app. Our findings encouraged us to focus on promoting knowledge retention through reinforcement, testing information through active recall, and simplifying notes organization.\n\nGiven that our focus was on promoting knowledge retention through reinforcement, testing information through active recall, and simplifying notes organization, we made sure to integrate each of these points as core components of our design. The central mechanic of our note-taking app is to transform both individual thoughts and information learned from media to complex beliefs and knowledge. This is done by promoting frequent writing and research and then actively exploring connections and parallels between concepts to achieve interdisciplinary nuance. This was done to fix knowledge retention and stray away from over-reliance on AI tools for answers.\n\nConsidering our user demographics, we prioritized creating tools for students to better study academic materials. We provided a tool for creating relevant study practice problems based on class notes. It includes customizability for length, complexity, and question types to account for a wide range of subjects. The questions and feedback format allows for personalized tutoring and strengthens active recall skills. Additionally, another core feature of our app are daily critical thinking prompts, which takes recent notes you wrote and generates thought-provoking philosophical questions to foster nuance and understanding of subjects beyond what is normally discussed.\n\nSince a majority of our survey users agreed that AI could improve learning by simplifying organization and reducing tedious tasks, the defining characteristic of our app was the intuitive and adaptive database organization system, built out of nodes and connections, representing topical relation and relevance. In contrast to a nested folder organization system where similar notes can frequently be lost or miscategorized, this tree based system allows for limitless topical linkage, organizing notes by the key ideas discussed within. Similar notes are closer in distance and share topic parent nodes. Topic nodes can relate to larger topic nodes, highlighting the most relevant ideas that populate each user’s personalized second brain. The tree is highly interactive and can showcase the entire timeline of your second brain. Whenever you write a note, related notes will pop up so that you can reference related ideas and so you never accidentally rewrite the same idea twice.\n\nGiven that many of our survey users learned best from experiential, visual, and social learning, our explore tab caters to further knowledge exploration. The hub promotes article, book, and video recommendations based on your current favorite topics, encouraging users to dive deeper into their knowledge pool and consider other perspectives. The tab also supports a public forum platform for users to share their most pressed takes and thoughts with the world, encouraging active learning through discussions.\n\nLastly, progress statistics were included to gamify the writing and learning process and to give users easily accessible information on their writing habits, allowing the learning process to progress from a trial into a way of life."
}
