{
  "title": "This Portfolio?",
  "briefDescription": "You never believe what this leads to.",
  "longDescription": "My most up-to-date portfolio website, featuring a custom design system, experimental physics simulations, and dynamic interactions.",
  "type": "Live Site",
  "ref": "https://portfolio-nu-ashen-14.vercel.app/",
  "creationDate": "June 2025",
  "tags": ["React", "CSS3", "HTML5", "JavaScript"],  "mainImage": "/Shuksan.jpg",
  "galleryImages": [
    "/Windows.png",
    "/Type and Color.png"
  ],
  "bodyText": "This is the second portfolio website I have coded. My first portfolio was made last year using static HTML/CSS and was hosted on Github Pages. Since then, I have acquired a few more programming skills and a better knack for visual digital design. My goal for this project was to challenge my technical capabilities and focus heavily on my brand identity.\n\nBefore an IDE was even touched, I spent several weeks viewing other web portfolios and pocketing them in a folder for aspects I liked. I also spent a good chunk of time on wiby.com looking at early Internet personal landing pages, as the nostalgic and highly personalized look was something I wanted to capture in my design. Ultimately, the two great sources of inspiration for my design palette were the SIGGRAPH 2024 conference website and Niccolo Miranda's 'The Paper Portfolio' (visit it at https://www.niccolomiranda.com). I was heavily inspired by the color palette, gradient borders, and grain effect of SIGGRAPH 2024, which I reflected in my site identity. I leaned on a dark mode theme, with white text, gray highlights, and an earth-toned accent gradient. My project pages referenced the Paper Portfolio's image gallery, newspaper-styled text wrapping, and headline formatted project descriptions.\n\nThe most challenging component of my site no doubt was the floating simulation displaying my skills and technical tools. I used Javascript variables to bound every skill image, treating them as circular objects with an object boundary anf larger repulsion boundary. When the homepage loads, the simulation will randomize a start position for each object and force calculations are done so that objects will continuously trend towards maximally repelling each other. Cursor interactions are also treated as an object, allowing you to repel objects around you cursor.\n\nThis portfolio is in constant development for the forseeable future, and should be an updated backlog for my most recent projects. I am looking into adding a Blogs page and an expanded About Me page."
}
